
## :x: Apply Failed (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8675888651)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
google_project_service.vision_api: Refreshing state... [id=lgtmgen-project/vision.googleapis.com]
google_project_service.firestore_api: Refreshing state... [id=lgtmgen-project/firestore.googleapis.com]
google_firestore_database.datastore_mode_database: Refreshing state... [id=projects/lgtmgen-project/databases/(default)]
data.google_iam_policy.noauth: Reading...
google_storage_bucket.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_artifact_registry_repository.main-repo: Refreshing state... [id=projects/lgtmgen-project/locations/asia-northeast1/repositories/dev-main]
google_cloud_run_service.cloudrun-dev-main-backend: Refreshing state... [id=locations/asia-northeast1/namespaces/lgtmgen-project/services/dev-main-backend]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/lgtmgen-project/locations/asia-northeast1/services/dev-main-backend]
google_cloud_run_domain_mapping.domain-mapping: Refreshing state... [id=locations/asia-northeast1/namespaces/lgtmgen-project/domainmappings/lgtm.a.shion.pro]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.domain-mapping is tainted, so must be replaced
-/+ resource "google_cloud_run_domain_mapping" "domain-mapping" {
      ~ id       = "locations/asia-northeast1/namespaces/lgtmgen-project/domainmappings/lgtm.a.shion.pro" -> (known after apply)
        name     = "lgtm.a.shion.pro"
      ~ status   = [
          - {
              - conditions          = [
                  - {
                      - message = "Caller is not authorized to administer the domain 'lgtm.a.shion.pro'. If you own 'lgtm.a.shion.pro', you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=lgtm.a.shion.pro. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com')."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = "Certificate will not be provisioned unless the domain is made routable."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "CertificateProvisioned"
                    },
                  - {
                      - message = "Caller is not authorized to administer the domain 'lgtm.a.shion.pro'. If you own 'lgtm.a.shion.pro', you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=lgtm.a.shion.pro. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com')."
                      - reason  = "PermissionDenied"
                      - status  = "False"
                      - type    = "DomainRoutable"
                    },
                ]
              - observed_generation = 1
              - resource_records    = []
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ metadata {
          - annotations           = {} -> null
          ~ effective_annotations = {
              - "run.googleapis.com/operation-id"  = "a2fa65ba-3750-4c1c-8628-d588973c0161"
              - "serving.knative.dev/creator"      = "gh-actions@lgtmgen-project.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "gh-actions@lgtmgen-project.iam.gserviceaccount.com"
            } -> (known after apply)
          ~ effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> (known after apply)
          ~ generation            = 1 -> 0
          - labels                = {} -> null
          ~ resource_version      = "AAYV+Cvamzk" -> (known after apply)
          ~ self_link             = "/apis/domains.cloudrun.com/v1/namespaces/228944830644/domainmappings/lgtm.a.shion.pro" -> (known after apply)
          ~ terraform_labels      = {} -> (known after apply)
          ~ uid                   = "19a692a7-6b70-47e8-bca1-55b487eadd7e" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - force_override   = false -> null
            # (2 unchanged attributes hidden)
        }
    }

  # google_firebase_database_instance.default will be created
  + resource "google_firebase_database_instance" "default" {
      + database_url  = (known after apply)
      + desired_state = "ACTIVE"
      + id            = (known after apply)
      + instance_id   = "lgtmgen-project-default-rtdb"
      + name          = (known after apply)
      + project       = "lgtmgen-project"
      + region        = "asia-southeast1"
      + state         = (known after apply)
      + type          = "DEFAULT_DATABASE"
    }

  # google_firebase_project.default will be created
  + resource "google_firebase_project" "default" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = "lgtmgen-project"
      + project_number = (known after apply)
    }

  # google_project_service.firebase_database will be created
  + resource "google_project_service" "firebase_database" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "lgtmgen-project"
      + service            = "firebasedatabase.googleapis.com"
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 4 to add, 1 to change, 1 to destroy.
google_firebase_project.default: Creating...
google_cloud_run_domain_mapping.domain-mapping: Destroying... [id=locations/asia-northeast1/namespaces/lgtmgen-project/domainmappings/lgtm.a.shion.pro]
google_storage_bucket.public_image_bucket: Modifying... [id=lgtm-public-image-bucket]
google_firebase_project.default: Creation complete after 0s [id=projects/lgtmgen-project]
google_project_service.firebase_database: Creating...
google_storage_bucket.public_image_bucket: Modifications complete after 1s [id=lgtm-public-image-bucket]
google_cloud_run_domain_mapping.domain-mapping: Destruction complete after 2s
google_cloud_run_domain_mapping.domain-mapping: Creating...
google_project_service.firebase_database: Creation complete after 3s [id=lgtmgen-project/firebasedatabase.googleapis.com]
google_firebase_database_instance.default: Creating...
google_firebase_database_instance.default: Creation complete after 1s [id=projects/lgtmgen-project/locations/asia-southeast1/instances/lgtmgen-project-default-rtdb]
╷
│ Error: Error waiting to create DomainMapping: resource is in failed state "Ready:False", message: Caller is not authorized to administer the domain 'lgtm.a.shion.pro'. If you own 'lgtm.a.shion.pro', you can obtain authorization by verifying ownership of the domain, or any of its parent domains, via the Webmaster Central portal: https://www.google.com/webmasters/verification/verification?domain=lgtm.a.shion.pro. We recommend verifying ownership of the largest scope you wish to use with subdomains (eg. verify 'example.com' if you wish to map 'subdomain.example.com').
│ 
│   with google_cloud_run_domain_mapping.domain-mapping,
│   on cloudrun.tf line 36, in resource "google_cloud_run_domain_mapping" "domain-mapping":
│   36: resource "google_cloud_run_domain_mapping" "domain-mapping" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":13,"Program":"tfcmt","SHA1":"8554e1c75c2a3adb91452d62f847335e0afe5dcb","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->